[M_TaggartBiography MissionDefinition]
MissionDescription="Sir Hammerlock needs information on stalkers, and a former boyfriend of his named Taggart has already begun writing a book about his attempts to exterminate the species entirely. Hammerlock wants you to collect the chapters of Taggart's audiobook so he can plagiarize them."
TurnInDescription="You found Taggart's missing chapters and, in so doing, discovered a soul-crushing truth: all the confidence in the world cannot prevent you from dying frightened and alone. But on the upside, you got PAID!"

[M_TaggartBiography:MissionObjectiveDefinition_6 MissionObjectiveDefinition]
ProgressMessage="Hunt stalkers"
